emacs/.config/emacs/emacs.org
#+TITLE: GNU Emacs Configuration
#+AUTHOR: Aleks Ozolins
#+EMAIL: aleks@ozolins.xyz
#+OPTIONS: toc:2
#+STARTUP: show2levels
#+PROPERTY: header-args:elisp :tangle ~/.dotfiles/emacs/.config/emacs/init.el

+ Created: 2022-06-24
+ Updated: 2023-08-19

*Note:* the following two code blocks were last evaluated on Mac - I do also use a Linux system.

Information pertaining to my current build of Emacs:

#+begin_src emacs-lisp :tangle no :exports both
  (emacs-version)
#+end_src

#+RESULTS:
: GNU Emacs 29.1 (build 1, aarch64-apple-darwin21.6.0, NS appkit-2113.60 Version 12.6.6 (Build 21G646))
:  of 2023-08-17

System configuration options:

#+begin_src emacs-lisp :tangle no :exports both
  system-configuration-options
#+end_src

#+RESULTS:
: --with-ns '--enable-locallisppath=/Library/Application Support/Emacs/${version}/site-lisp:/Library/Application Support/Emacs/site-lisp' --with-modules 'CFLAGS=-DFD_SETSIZE=10000 -DDARWIN_UNLIMITED_SELECT' --with-x-toolkit=no

* TODOs
** DONE Debug customizations for Modus Themes
CLOSED: [2023-08-19 Sat 23:19]
:LOGBOOK:
- State "DONE"       from "TODO"       [2023-08-19 Sat 23:19]
:END:

** TODO Fix org-agenda-tag-filter-preset issue
** TODO Set up Denote for new workflows
** TODO Migrate org-roam data to Denote
** TODO Move to orderless for completion framework
** TODO Move some custom functions to their own packages
** TODO Figure out better archiving for todos.org
** TODO Consider trashing org-contacts
** TODO Clean up mu4e config

* Packages
** Package Sources

#+begin_src elisp
  ;; Initialize package sources
  (require 'package)

  (setq package-archives '(("melpa" . "https://melpa.org/packages/")
			   ("elpa" . "https://elpa.gnu.org/packages/")))

  (package-initialize)
  (unless package-archive-contents
    (package-refresh-contents))

#+end_src

** use-package

#+begin_src elisp
  (require 'use-package)
  (setq use-package-always-ensure t)

#+end_src

* Clean Up The Interface

The following settings make the interface a bit more minimal and clean.

#+begin_src elisp
  (setq inhibit-startup-message t)      ; Disable startup message
  (menu-bar-mode -1)                    ; Disable the menu bar
  (scroll-bar-mode -1)                  ; Disable the scroll bar
  (tool-bar-mode -1)                    ; Disable the toolbar
  (tooltip-mode -1)                     ; Disable tooltips
  (set-fringe-mode 10)                  ; Give some breathing room
  (setq visible-bell t)                 ; Set up the visible bell
  (minibuffer-electric-default-mode t)  ; Make default disappear in the minibuffer when typing
  (setq suggest-key-bindings 3)         ; Make keybinding suggestions stick around longer

  ;; Change the startup message in the minibuffer to a nice greeting
  (defun display-startup-echo-area-message ()
    (message "Welcome back Aleks!"))

#+end_src

* Other Settings

Below are any settings where I'm not quite sure where to put in this file just yet.

#+begin_src elisp

  (setq vc-follow-symlinks nil) ; Stop Emacs from asking about following symlinks when opening files
  (recentf-mode 1) ; Have Emacs remember recently opened files when using fild file

  ;; Save what you enter into minibuffer prompts
  (setq history-length 25)
  (savehist-mode 1)

  (save-place-mode 1) ; Remember and restore the last cursor location of opened files

  (global-auto-revert-mode 1) ; Revert buffers when the underlying file has changed
  (setq global-auto-revert-non-file-buffers t) ; Revert Dired and other buffers

  (windmove-default-keybindings 'super) ; Navigate between windows with s-<arrow keys>
  
#+end_src

* Line Numbers

#+begin_src elisp
  ;; Line numbers
  (column-number-mode)
  (global-display-line-numbers-mode -1) ; Right now they are disabled

  ;; Disable line numbers for some modes
  (dolist (mode '(org-mode-hook
                  term-mode-hook
                  shell-mode-hook
                  eshell-mode-hook
                  mu4e-headers-mode-hook
                  mu4e-main-mode-hook
                  mu4e-view-mode-hook
                  org-agenda-mode-hook))
    (add-hook mode (lambda () (display-line-numbers-mode 0))))
  
#+end_src

* Set Fonts

Very basic setting for now. Using Liberation Mono in Linux and Monaco on the Mac.

#+begin_src elisp
  (pcase system-type
    ('gnu/linux
     (set-face-attribute 'default nil :font "Liberation Mono" :height 140))
    ('darwin
     (set-face-attribute 'default nil :font "Monaco" :height 170)))

#+end_src

* Set a Theme

I'm using the Modus themes which are supplied out of the box. They were built by Protesilaos Stavrou.

More info here: [[https://protesilaos.com/emacs/modus-themes][Modus Themes]]

#+begin_src elisp
  (setq modus-themes-mode-line '(accented)
      modus-themes-bold-constructs t
      modus-themes-fringes 'subtle
      modus-themes-tabs-accented t
      modus-themes-paren-match '(bold-intense)
      modus-themes-prompts '(bold-intense)
      modus-themes-org-blocks 'tinted-background
      modus-themes-region '(bg-only)
      modus-themes-headings
      '((0 . (1.6))
        (1 . (rainbow overline background 1.2))
        (2 . (rainbow background 1.1))
        (3 . (rainbow bold 1))
        (t . (semilight 1))))

  ;; Load a Theme
  (load-theme 'modus-operandi t)

  ;; Set a hot-key for switching between light and dark theme
  (define-key global-map (kbd "<f5>") #'modus-themes-toggle)

#+end_src

* Backup Settings

#+begin_src elisp
  ;; Backup options
  (setq backup-directory-alist '(("." . "~/.config/emacs/backup/"))
	backup-by-copying t    ; Don't delink hardlinks
	version-control t      ; Use version numbers on backups
	delete-old-versions t  ; Automatically delete excess backups
	kept-new-versions 20   ; how many of the newest versions to keep
	kept-old-versions 5    ; and how many of the old
	)

  ;; auto-save
  (setq auto-save-file-name-transforms
	`((".*" ,temporary-file-directory t)))

  (setq kill-buffer-delete-auto-save-files t)
  
#+end_src

* Key Re-bindings

Here's where I'm deviating from Emacs' built in key-bindings or adding my own bespoke bindings.

#+begin_src elisp
  ;; Key re-bindings
  (global-set-key (kbd "M-o") 'other-window)    ; Move to the other window C-x o but also now M-o
  (global-set-key (kbd "M-i") 'imenu)           ; Invoke imenu. This replaces tab-to-tab-stop but what is that even?

#+end_src

* Set authinfo Source

I'd like emacs to default to using authinfo.gpg to store passwords

#+begin_src elisp
  (setq auth-sources '("~/.authinfo.gpg"))

#+end_src

* Bookmarks

Set the bookmarks file to synchronize via Dropbox. The same file will be in slightly different locations depending on whether we're on Linux or macOS.

#+begin_src elisp
  (setq bookmark-default-file
	(pcase system-type
	  ('gnu/linux "~/Dropbox/apps/emacs/bookmarks")
	  ('darwin "~/Library/CloudStorage/Dropbox/apps/emacs/bookmarks")))

#+end_src

Bind =bookmark-bmenu-list= to =F8=

#+begin_src elisp
  (global-set-key (kbd "<f8>") 'bookmark-bmenu-list)

#+end_src

* Completion Framework

We'll define the default completion style(s) here before adding features:

#+begin_src elisp
  (setq completion-styles '(substring))  ;; define the completion style
  (setq completion-ignore-case  t)  ;; ignore case
  
#+end_src

* Which-Key

#+begin_src elisp
  ;; which-key
  (use-package which-key
    :init (which-key-mode)
    :diminish which-key-mode
    :config
    (setq which-key-idle-delay 0.3))
  
#+end_src

* Vertico

This is the main completion framework I've chosen, over Ivy or Helm as it is more minimal and uses emacs' built in features.

#+begin_src elisp
  ;; Vertico
  (use-package vertico
    :ensure t
    :custom
    (vertico-cycle t)
    :init
    (vertico-mode))
  
#+end_src

* Marginalia

Marginalia provides extra information in each completion buffer to the right of selection when using Vertico.

#+begin_src elisp
  (use-package marginalia
    :after vertico
    :ensure t
    :custom
    (marginalia-annotators '(marginalia-annotators-heavy marginalia-annotators-light nil))
    :init
    (marginalia-mode))
  
#+end_src

* Corfu

Corfu enhances completion at point with a small completion popup. The current candidates are shown in a popup below or above the point. Corfu is the minimalistic completion-in-region counterpart of the Vertico minibuffer UI.

The following code is taken right from Prot's config:

#+begin_src elisp
  (use-package corfu
    :ensure t)

  (global-corfu-mode 1)

  (corfu-popupinfo-mode 1) ; shows documentation after `corfu-popupinfo-delay'

  (define-key corfu-map (kbd "<tab>") #'corfu-complete)
  (setq tab-always-indent 'complete) ;; This we needed for tab to work. Not from Prot's config.

  ;; Adapted from Corfu's manual.
  (defun contrib/corfu-enable-always-in-minibuffer ()
    "Enable Corfu in the minibuffer if Vertico is not active.
    Useful for prompts such as `eval-expression' and `shell-command'."
    (unless (bound-and-true-p vertico--input)
      (corfu-mode 1)))

  (add-hook 'minibuffer-setup-hook #'contrib/corfu-enable-always-in-minibuffer 1)

#+end_src

* Embark

Embark is invoked by using =C-.= and allows common operations to be performed to selections from within the completion buffer. For instance, you can delete or rename files without ever opening a =dired= buffer.

#+begin_src elisp
  (use-package embark
    :ensure t
    :bind
    (("C-." . embark-act)
     ("M-." . embark-dwim)
     ("C-h B" . embark-bindings))
    :init
    (setq prefix-help-command #'embark-prefix-help-command))
  
#+end_src

* Dired
** New Config

This basic config was generated with the help of GPT4

#+begin_src elisp
  ;; Use GNU ls as insert-directory-program in case of macOS
  (when (eq system-type 'darwin)
    (setq insert-directory-program "gls"))

  ;; Use human readable sizes and group directories first
  (setq dired-listing-switches "-alh --group-directories-first")

  (setq dired-dwim-target t)            ;; When copying/moving, suggest other dired buffer as target
  (setq dired-recursive-copies 'always) ;; Always copy/delete recursively
  (setq dired-recursive-deletes 'top)   ;; Ask once before performing a recursive delete

  ;; Hide details by default
  (add-hook 'dired-mode-hook
	    (lambda ()
	      (dired-hide-details-mode 1)))
  
  ;; Do not disable using 'a' to visit a new directory without killing the buffer
  (put 'dired-find-alternate-file 'disabled nil)

#+end_src

Add this package to enable the hiding of dotfiles

#+begin_src elisp
  (use-package dired-hide-dotfiles
    :ensure t)

  (defun my-dired-mode-hook ()
    "My `dired' mode hook."
    ;; To hide dot-files by default
    (dired-hide-dotfiles-mode))

  ;; To toggle hiding
  (define-key dired-mode-map "." #'dired-hide-dotfiles-mode)
  (add-hook 'dired-mode-hook #'my-dired-mode-hook)

#+end_src

** Use xdg-open To Open Files

Note: We've bound this to =V= as an alternative to ~dired-view-file~ which is bound to =v=

#+begin_src elisp
  (defun dired-xdg-open-file ()
    "Use xdg-open command on a file from dired."
    (interactive)
    (let ((file (dired-get-file-for-visit)))
      (message "Opening %s..." file)
      (call-process "xdg-open" nil 0 nil file)))

  (define-key dired-mode-map (kbd "V") 'dired-xdg-open-file)

#+end_src

* Rainbow Delimiters

The =rainbow-delimiters= package makes each new set of parenthesis a different color so it's easy to see when they match!

#+begin_src elisp
  (use-package rainbow-delimiters
    :hook (prog-mode . rainbow-delimiters-mode))
  
#+end_src

* Magit

Magit is the most common git interface for Emacs and doesn't require any additional configuration out of the box. It can be invoked by =C-x g=

#+begin_src elisp
  ;; Magit
  (use-package magit
    :ensure t)
  
#+end_src

* Pulsar

Pulsar highlights the current line when changing buffers.

#+begin_src elisp
  (use-package pulsar
    :ensure t
    :init
    (setq pulsar-pulse t
	  pulsar-delay 0.055
	  pulsar-iterations 10
	  pulsar-face 'pulsar-magenta
	  pulsar-highlight-face 'pulsar-blue)
    :config
    (pulsar-global-mode 1)
    (let ((map global-map))
      (define-key map (kbd "C-x l") #'pulsar-pulse-line)
      (define-key map (kbd "C-x L") #'pulsar-highlight-dwim)))

#+end_src

* Ledger

I use this to manage my finances

** ledger-mode

#+begin_src elisp
  (use-package ledger-mode
    :config
    (setq ledger-clear-whole-transactions 1)
    (setq ledger-default-date-format "%Y-%m-%d"))

  ;; Any file ending in _ledger.txt opens in ledger mode
  (add-to-list 'auto-mode-alist '("_ledger\\.txt\\'" . ledger-mode))

#+end_src

** Open My Ledger With F4

#+begin_src elisp
  (defun my/my-ledger ()
    "Open the ledger file located at ~/docs/finances/ledger/my_ledger.txt."
    (interactive)
    (find-file "~/docs/finances/ledger/my_ledger.txt")
    (goto-char (point-max)))

  ;; Bind the function to F4
  (global-set-key (kbd "<f4>") 'my/my-ledger)

#+end_src

